masm
.model small                           ;Тип моделі пам’яті
.stack 100h                              ;Сегмент стеку
.data                                         ;Сегмент даних
a dw  0ffffh                         ;Визначення в пам'яті 
b dw  0ffffh                               ;операндів     
c dd 0                                             ;та добутку
.code                                       ;Сегмент програми
exe:mov ax,@data                  ;Сегменти DS, ES в фізичній       
 mov ds,ax                               ;пам’яті  накладені 
 lea si,a  			        ;Ініціалізація 
 lea di,b                                    ;покажчиків 
 lea bx,c  			        ;адреси
mov al,[si]                               ;Перше множиме 
mul byte ptr [di]                      ;Перший частковий добуток
add [bx],ax                              ;Перша сума часкового добутку
mov al,[si]+1                           ;Друге множиме 
mul byte ptr [di]                      ;Другий  частковий добуток
add [bx]+1,ax                          ;Друга сума часткового добутку 
mov al,[si]                               ;Третє множиме 
mul byte ptr [di]+1                 ;Третій  частковий добуток
add [bx]+1,ax                          ;Третя сума часткового добутку
adc byte ptr [bx]+3,0               ;Урахування вихідного перенесення
mov al,[si]+1                           ;Четверте множиме 
mul byte ptr [di]+1                  ;Четвертий частковий добуток
add [bx]+2,ax                          ;Четверта сума часткового добутку
test [si],8000h                         ;Кон’юнктивне маскування множимого  
jz nx1                                      ;Множиме  додатне
mov ax,[di]                              ;Корекція псевдо добутку
sub [bx]+2,ax                          ; відніманням множника
nx1: test [di],8000h                 ;Кон’юнктивне маскування множника
jz nx2                                      ;Множник  додатний
mov ax,[si]                              ;Корекція псевдо добутку
sub [bx]+2,ax                          ;відніманням множимого
nx2:mov ax, [si]                      ;Завантаження множимого
imul word ptr [di]                    ;Формування істинного добутку
mov ax,4c00h                        ; Програмне
 int 21h                                   ; повернення в MS DOS
end exe                                  ; Закінчення програми


