;Дослідження команд умовного галудження
masm
.model small                                     ;Тип моделі пам’яті
.stack 100h                                      ;Сегмент стеку
.data                                            ;Сегмент даних
X db 99;Перший операнд-множеме  
Y db 88;Другий операнд-множник   
Z dw ? ;Результат-добуток                                               
mes_1 db 'Unsigned multiplication start',0ah,0dh,'$' 
mes_2 db ' Unsigned multiplication stop',0ah,0dh,'$'
len equ 8 ;Розряднысть співмножників
.code  ;Сегмент програми                                          
mes macro mes                      ;Макрос програмного
    mov ah,09h                     ;виведення 
    mov dx,offset mes              ;повідомлення
    int 21h                        ;за перериванням                             
    endm
   uml proc near             ;Процедураблизького виклику 
        mov cx,len             
        mov dh,0         ;Початкова сума приватніх добутків
   @nxt:ror byte ptr Y,1 ;Переміщення біту множника в CF    
        jnc @nad         ;Приватний добуток дорівнює нолю
        add dh,X         ;Формування текучої суми приватніх добутків
   @nad:rcr dx,1         ;Циклічний зсув управо текучої суми приватніх добутків
        loop @nxt        ;Корекція програмного лічильникаі передача управління 
        mov z,dx         ;Пересилка добутку в приймач у пам'яті
        ret
        endp uml  
   exc:mov ax,@data                    ;Ініціалізація        
       mov ds,ax                       ;сегменту DS  
       mes mes_1                       ;Суть повідомлення на екрані
       call uml                        ;Множення чисел
       mes mes_2                       ;Суть повідомлення на екрані
       mov ax,4c00h                    ;Програмне
       int 21h                         ;повернення в MS DOS 
       end exc














