;Лістинг 2 – Програма керування роботою зовнішнього лічильника
         
model small 
scr macro x              ;Макрос видачі на екран текстового повідомлення 
local lpp,ext               ;Опис поміток в макросі
     xor bx,bx               ;Скид в ноль
lpp:mov al, x[bx]        ; Текучий символу з пам'яті  
     cmp al,0                ; Порівняння з нулем
     je ext                     ; Так є ноль та вийти з циклу
     mov ah, 0eh          ; Функція переривання
     int 10h                  ;Виведення символу на екран
     inc bx                    ; Корекція на плюс один адреси 
     jmp lpp                 ; Перехід на повторення
ext:cur                       ; Переведення курсору
     endm
cur macro               ;Переклад курсору на новий рядок
      mov ah,2
      mov dl,0dh                
      int 21h                     
      mov dl,0ah
      int 21h               
      endm
sign macro xxx    ;Формування імпульсу керування
       mov al,xxx     ;Завантаження BSR дла установки
       out ppi+2,al   ;Установка лінії в одиницю
       dely                ;Термін часу затримки 
       dec al             ;Формування  BSR дла скиду
       out ppi+2,al   ;Скид лінії в ноль
       paus               ;Витримка паузи
       endm
dely macro       ;Формування затримки 
local nn
         xor cx,cx  ;Максимальний параметр затримки
    nn:loop nn     ;Зациклення на параметр затримки
         endm
paus macro        ;Формування паузи
       local  mm
       mov cx, 3     ;Визначення щільності сигналів
mm:dely              ;Термін затримки
        loop mm      ;Зациклення на термін щільності 
        endm
kayx macro      ;Макрос очікування натиску х
local wit
        mov ah,7
   wit:int 21h
        cmp al,'x'
        jne wit
        endm
init macro           ;Макрос програмування адаптера
      mov al, ms     ;Слово програмування адаптера 
      out ppi+4, al  ;Вибір напрямку портів
      xor al,al          ;Формування нуля
      out ppi+2, al   ;Скид ліній порту С
      endm
.stack 100h
.data
ms equ 98h           ;Слово MS вибору режиму адаптера
stb equ 01h           ;Слово BSR для установки STB 
clk equ 03h           ;Слово BSR для установки CLK
clr equ 07h            ;Слово BSR для установки CLR
mde equ 05h         ;Слово BSR для установки MDE
ppi equ 4Bh         ;Адреса адаптера
pb equ ppi             ;Початковий порт адаптера
mesk equ 10h        ;Маска селекції стану тригеру
k equ 6                    ;Коефіцієнт рахунку
mes_1 db '                                               TKZ-2',0
mes_2 db '                                           Romasenko Denis',10,13,0
.code 
stt:mov ax,@data    ;Початок основної програми   
    mov ds,ax             ;Визначення сегменту даних
    init                        ;Ініціалізація адаптера
    scr mes_1            ;Виведення повідомлення
    jmp exit                ;Обхід неіснуючих портів в комп’ютері 
    in al, ppi+2           ;Читання порту С
    and al, mesk         ;Селекція стану тригеру
    je skip                   ;Тригер в нулі
    sign clr                   ;Скид тригера в ноль
skip:mov al,16-k      ;Завантаження надлишку 
       out ppi,al            ;заданого модуля
        sign stb              ;Запис надлишку в лічильник
next:sign clk             ;Рахункові сигнали        
        in al, ppi+2       ; Читання стану порту С
        and al,mesk       ;Селекція стану тригеру
        jz next                ;Тригер в нолі
        in al, ppi+6       ; Читання стану порту А
        and al,0Fh         ;Селекція стану лічильника
        jnz exut              ;Лічильник не в нолі
exit:cur                       ; Переклад екранного курсору     
       kayx                 ; Очікування натиску клавіші  
exut:scr mes_2            ;Виведення повідомлення       
       mov ax,4c00h     ;Вихід в
        int 21h                ;операційну систему      
       end stt 
