model small 
.stack 100h;Сегмент стеку
.data            ;Сегмент даних
a equ 1       ;Визначення
b equ 9        ;вхідних
c equ 10        ;параметрів
CT db ?      ;Визначення лічильника в пам’яті
.code           ;Сегмент програми
   stt:mov ax,@data    ;Початок основної програми   
        mov ds,ax             ;Визначення сегменту даних
        mov al, a              ;Визначення початкового стану лічильника
whil:mov CT, al          ;Збереження стану лічильника в пам’яті
         cmp al, b             ;Порівняння з параметром
         jc repa              ;Виконується умова (СТ) < b для виходу
         dec al                   ;Операція  СТ:= (СТ) - 1
         and al,0fh           ;Обмеження робочого діапазону 0..15
         jmp whil             ;Перехід на перед умовний цикл керування
repa:inc al                 ;Операція  СТ:= (СТ) +1
         and al,0fh          ;Обмеження робочого діапазону 0..15
        mov CT, al         ;Збереження стану лічильника в пам’яті
        cmp al, c             ;Порівняння з параметром
        jc repa                ;Умова (СТ) < c для переходу на пост цикл
        ; jz repa               Умова (СТ) = c для переходу на пост цикл       
        mov ax,4c00h     ;Повернення в
        int 21h                ;операційну систему      
       end stt 

